[{"author":null,"categories":["Math"],"content":"Calculus 1 Overview Calculus is the toolkit we use to talk about two things:\nHow fast something is changing right now How much has piled up over time That’s it. In SRE terms: “Is this metric spiking this second?” and “How much total impact did we take this hour?”\nMore formally, Calculus is the math of change and accumulation. In day-to-day engineering, and especially in SRE, you constantly estimate rates (error growth, QPS spikes), optimize configurations (cost vs. latency), and reason about cumulative effects (downtime minutes, p95 tails). Calculus gives you the formal tools for those instincts: limits (what happens as we approach something), derivatives (how fast it’s changing), and integrals (how much has accumulated).\nBelow I’ll walk through the Sophia Learning Calculus I unit map and connect each topic to practical, real-world and SRE-flavored examples.\nUnit 1: A quick pre-calculus refresh You’ll warm up with lines, basic functions, and how graphs behave.\nLines: A line has a …","date":1758816000,"dir":"post/","expirydate":-62135596800,"fuzzywordcount":1300,"html":"Tour of Calculus I (limits, derivatives, integrals) explained in everyday language. See how “rate of change” and “total over time” show up in real life and SRE work.","keywords":null,"kind":"page","lang":"en","lastmod":1758816000,"objectID":"995b10359f57032c771b1789bf2fce37","permalink":"http://localhost:1313/2025/09/25/calculus-1-overview/","publishdate":"2025-09-25T12:00:00-04:00","readingtime":6,"relpermalink":"/2025/09/25/calculus-1-overview/","section":"post","tags":["Math","Calculus 1"],"title":"Calculus 1 Overview","type":"post","url":"/2025/09/25/calculus-1-overview/","weight":0,"wordcount":1246},{"author":null,"categories":null,"content":"About Learn with O.J. is my public notebook as I earn a B.S. in Computer Science (and later an M.S. in CS) the practical way: by building, breaking, and explaining as I go. I’m Olivia (“O.J.”), a senior SRE/software engineer and Computer Science student who believes the fastest way to master something is to teach it clearly.\n\u0026amp;ldquo;If you can\u0026amp;rsquo;t explain it simply, you don\u0026amp;rsquo;t understand it well enough.\u0026amp;rdquo;\nWhat you’ll find here Course-aligned guides: Calculus I, Discrete Math I, Java Fundamentals, Data Structures \u0026amp;amp; Algorithms I, Data Management/SQL, Computer Architecture, Version Control (Git), Scripting \u0026amp;amp; Programming Applications, Software Engineering, Intro to AI for CS, Network \u0026amp;amp; Security Foundations, Fundamentals of Information Security, and Systems Thinking. Certification notes: LPI Linux Essentials, CompTIA Network+ (and other foundational certs as they make sense). SRE-flavored context: Reliability principles, incident-ready habits, and “how this shows up …","date":-62135596800,"dir":"about/","expirydate":-62135596800,"fuzzywordcount":400,"html":null,"keywords":null,"kind":"page","lang":"en","lastmod":-62135596800,"objectID":"8576ec274c98b3831668a172fa632d80","permalink":"http://localhost:1313/about/","publishdate":"0001-01-01T00:00:00Z","readingtime":2,"relpermalink":"/about/","section":"","tags":null,"title":"","type":"page","url":"/about/","weight":0,"wordcount":342},{"author":null,"categories":null,"content":"","date":-62135596800,"dir":"search/","expirydate":-62135596800,"fuzzywordcount":100,"html":null,"keywords":null,"kind":"page","lang":"en","lastmod":-62135596800,"objectID":"8946788897930c0c0c39fbfcd30ff2e4","permalink":"http://localhost:1313/search/placeholder/","publishdate":"0001-01-01T00:00:00Z","readingtime":0,"relpermalink":"/search/placeholder/","section":"search","tags":null,"title":"","type":"search","url":"/search/placeholder/","weight":0,"wordcount":0}]